Revit 2027 API
DocumentPrintedEventArgs.GetFailedViewElementIds Method
 Returns ElementIds of the views that that failed to print (if any).
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetFailedViewElementIds()
Public Function GetFailedViewElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetFailedViewElementIds()
member GetFailedViewElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 ElementIds of the views that that failed to print (if any).
See Also
Reference
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace